#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

int main()
{
	//输出num的补码中有几个1
	int num = 0;
	int i = 0;
	int count = 0;
	scanf("%d", &num);
	for (i = 0; i < 32; i++)													  //随便前面补什么，只算32次		
	{								 //10000000100000001000000010000001   //右移1次后11000000010000000100000001000000
		if (1 == ((num >> i) & 1))     //00000000000000000000000000000001  //&         00000000000000000000000000000001
			count++;				 //00000000000000000000000000000001				 00000000000000000000000000000000
	}
	printf("%d\n",count);
	return 0;
}